; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=98, out_folder=htg/blocksworld/training, instance_id=78, seed=2102, goal_proportion=0.1

(define (problem blocksworld-78)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on-table b1)
    (clear b6)
    (on b6 b17)
    (on b17 b41)
    (on b41 b42)
    (on-table b42)
    (clear b32)
    (on b32 b2)
    (on b2 b95)
    (on b95 b25)
    (on b25 b88)
    (on b88 b8)
    (on b8 b59)
    (on-table b59)
    (clear b38)
    (on-table b38)
    (clear b49)
    (on-table b49)
    (clear b26)
    (on-table b26)
    (clear b24)
    (on b24 b97)
    (on-table b97)
    (clear b61)
    (on b61 b71)
    (on-table b71)
    (clear b7)
    (on b7 b92)
    (on-table b92)
    (clear b47)
    (on b47 b72)
    (on b72 b27)
    (on b27 b80)
    (on b80 b51)
    (on b51 b64)
    (on b64 b70)
    (on-table b70)
    (clear b16)
    (on b16 b23)
    (on b23 b46)
    (on b46 b54)
    (on b54 b87)
    (on-table b87)
    (clear b77)
    (on b77 b43)
    (on-table b43)
    (clear b36)
    (on b36 b81)
    (on-table b81)
    (clear b84)
    (on b84 b85)
    (on b85 b48)
    (on-table b48)
    (clear b98)
    (on-table b98)
    (clear b73)
    (on b73 b34)
    (on b34 b96)
    (on b96 b69)
    (on b69 b91)
    (on b91 b58)
    (on b58 b10)
    (on b10 b66)
    (on b66 b76)
    (on b76 b93)
    (on b93 b78)
    (on b78 b52)
    (on-table b52)
    (clear b21)
    (on b21 b37)
    (on-table b37)
    (clear b45)
    (on b45 b33)
    (on b33 b12)
    (on b12 b15)
    (on b15 b56)
    (on b56 b20)
    (on b20 b75)
    (on-table b75)
    (clear b67)
    (on b67 b4)
    (on-table b4)
    (clear b35)
    (on b35 b28)
    (on-table b28)
    (clear b30)
    (on b30 b62)
    (on-table b62)
    (clear b86)
    (on b86 b18)
    (on-table b18)
    (clear b19)
    (on-table b19)
    (clear b63)
    (on-table b63)
    (clear b94)
    (on b94 b44)
    (on b44 b5)
    (on-table b5)
    (clear b9)
    (on b9 b53)
    (on b53 b50)
    (on b50 b29)
    (on b29 b3)
    (on b3 b31)
    (on b31 b79)
    (on b79 b82)
    (on b82 b13)
    (on b13 b22)
    (on b22 b11)
    (on b11 b55)
    (on b55 b57)
    (on b57 b89)
    (on b89 b83)
    (on b83 b68)
    (on-table b68)
    (clear b74)
    (on b74 b40)
    (on-table b40)
    (clear b60)
    (on b60 b14)
    (on b14 b65)
    (on b65 b90)
    (on b90 b39)
    (on-table b39))
 (:goal  (and 
    (clear b7)
    (on b7 b1)
    (on b1 b2)
    (on-table b2)
    (clear b6)
    (on b6 b3)
    (on b3 b4)
    (on-table b4)
    (clear b9)
    (on b9 b8)
    (on b8 b5)
    (on-table b5))))

; plan
1. (unstack b7 b92)
   deleted: (on b7 b92) (clear b7) (arm-empty)
   added: (holding b7) (clear b92)
   goals met: 4 of 12
2. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 6 of 12
3. (unstack b32 b2)
   deleted: (on b32 b2) (clear b32) (arm-empty)
   added: (holding b32) (clear b2)
   goals met: 6 of 12
4. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 6 of 12
5. (unstack b2 b95)
   deleted: (on b2 b95) (clear b2) (arm-empty)
   added: (holding b2) (clear b95)
   goals met: 6 of 12
6. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 12
7. (unstack b95 b25)
   deleted: (on b95 b25) (clear b95) (arm-empty)
   added: (holding b95) (clear b25)
   goals met: 7 of 12
8. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 7 of 12
9. (unstack b25 b88)
   deleted: (on b25 b88) (clear b25) (arm-empty)
   added: (holding b25) (clear b88)
   goals met: 7 of 12
10. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 7 of 12
11. (unstack b88 b8)
   deleted: (on b88 b8) (clear b88) (arm-empty)
   added: (holding b88) (clear b8)
   goals met: 7 of 12
12. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 7 of 12
13. (unstack b9 b53)
   deleted: (on b9 b53) (clear b9) (arm-empty)
   added: (holding b9) (clear b53)
   goals met: 6 of 12
14. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 8 of 12
15. (unstack b94 b44)
   deleted: (on b94 b44) (clear b94) (arm-empty)
   added: (holding b94) (clear b44)
   goals met: 8 of 12
16. (putdown b94)
   deleted: (holding b94)
   added: (clear b94) (arm-empty) (on-table b94)
   goals met: 8 of 12
17. (unstack b67 b4)
   deleted: (on b67 b4) (clear b67) (arm-empty)
   added: (holding b67) (clear b4)
   goals met: 8 of 12
18. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 8 of 12
19. (unstack b53 b50)
   deleted: (on b53 b50) (clear b53) (arm-empty)
   added: (holding b53) (clear b50)
   goals met: 8 of 12
20. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 8 of 12
21. (unstack b50 b29)
   deleted: (on b50 b29) (clear b50) (arm-empty)
   added: (holding b50) (clear b29)
   goals met: 8 of 12
22. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 8 of 12
23. (unstack b29 b3)
   deleted: (on b29 b3) (clear b29) (arm-empty)
   added: (holding b29) (clear b3)
   goals met: 8 of 12
24. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 8 of 12
25. (unstack b3 b31)
   deleted: (on b3 b31) (clear b3) (arm-empty)
   added: (holding b3) (clear b31)
   goals met: 8 of 12
26. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 9 of 12
27. (unstack b44 b5)
   deleted: (on b44 b5) (clear b44) (arm-empty)
   added: (holding b44) (clear b5)
   goals met: 9 of 12
28. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 9 of 12
29. (unstack b6 b17)
   deleted: (on b6 b17) (clear b6) (arm-empty)
   added: (holding b6) (clear b17)
   goals met: 8 of 12
30. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 10 of 12
31. (unstack b9 b8)
   deleted: (on b9 b8) (clear b9) (arm-empty)
   added: (holding b9) (clear b8)
   goals met: 8 of 12
32. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 9 of 12
33. (unstack b8 b59)
   deleted: (on b8 b59) (clear b8) (arm-empty)
   added: (holding b8) (clear b59)
   goals met: 9 of 12
34. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 10 of 12
35. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 9 of 12
36. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 11 of 12
37. (unstack b7 b1)
   deleted: (on b7 b1) (clear b7) (arm-empty)
   added: (holding b7) (clear b1)
   goals met: 9 of 12
38. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 10 of 12
39. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 10 of 12
40. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 11 of 12
41. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 10 of 12
42. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 12 of 12
